Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipePressureDropService
The external service which permits registration of an alternate implementation for pipe pressure drop calculation.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipePlumbingFixtureFlowService
The external service which permits registration of an alternate implementation for pipe fixture flow calculation.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipeFittingAndAccessoryPressureDropUIService
The external service which permits registration of an alternate implementation for a pipe fitting and accessory pressure drop calculation UI.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipeFittingAndAccessoryPressureDropService
The external service which permits registration of an alternate implementation for pipe fitting and accessory pressure drop calculation.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.DuctPressureDropService
The external service which permits registration of an alternate implementation for duct pressure drop calculation.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.DuctFittingAndAccessoryPressureDropUIService
The external service which permits registration of an alternate implementation for a duct fitting and accessory pressure drop calculation UI.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.DuctFittingAndAccessoryPressureDropService
The external service Id which permits registration of an alternate implementation for duct fitting and accessory pressure drop calculation.